[DroneHShock X2AbilityTemplate]
LocFriendlyName="无人机电击"
LocLongDescription="旨在安抚平民，此效果造成的伤害极小，仅会使目标眩晕."
LocHelpText="此武器造成的伤害极小，并会使目标受损."
LocFlyOverText="无人机电击"
LocPromotionPopupText=" 旨在安抚平民，此效果造成的伤害极小，仅会使目标眩晕."

[DroneHRepair X2AbilityTemplate]
LocFriendlyName="修理"
LocFlyOverText="修理"
LocHelpText="修理附近任何机械单位."
LocLongDescription="修理附近任何机械单位."
LocPromotionPopupText=" 修理附近任何机械单位."

[Drone_SelfAidProtocol X2AbilityTemplate]
LocFriendlyName="自我援助协议"
LocFlyOverText="自我援助协议"
LocHelpText="获得防御和黑客防御加成."
LocLongDescription="获得防御和黑客防御加成."
LocPromotionPopupText=" 获得防御和黑客防御加成."

[DroneHMeleeStun X2AbilityTemplate]
LocFriendlyName="眩晕器"
LocFlyOverText="眩晕器"
LocHelpText="尝试使近战范围内的任何敌人眩晕."
LocLongDescription="尝试使近战范围内的任何敌人眩晕."
LocPromotionPopupText=" 尝试使近战范围内的任何敌人眩晕."
LocMissMessage="未命中！"

[Drone_SelfDestruction_Charge X2AbilityTemplate]
LocFriendlyName="自毁初始化"
LocFlyOverText="自毁初始化"
LocHelpText="初始化自毁程序."
LocLongDescription="初始化自毁程序."
LocPromotionPopupText=" 初始化自毁程序."

[Drone_SelfDestruction X2AbilityTemplate]
LocFriendlyName="自毁"
LocFlyOverText="自毁"
LocHelpText="摧毁此单位，并在小范围内造成大量伤害."
LocLongDescription="摧毁此单位，并在小范围内造成大量伤害."
LocPromotionPopupText=" 自毁."

[AdvDroneHM1 X2CharacterTemplate]
strCharacterName="无人机"

[AdvDroneHM2 X2CharacterTemplate]
strCharacterName="高级无人机"

[AdvDroneHM3 X2CharacterTemplate]
strCharacterName="精英无人机"

[DroneHM1_WPN X2WeaponTemplate]
FriendlyName="无人机电击"

[DroneHM2_WPN X2WeaponTemplate]
FriendlyName="无人机电击"

[DroneHM3_WPN X2WeaponTemplate]
FriendlyName="无人机电击"


[CorpseDroneH X2ItemTemplate]
FriendlyName="无人机残骸"
FriendlyNamePlural="无人机残骸"
BriefSummary="无人机是一种具有高机动性的单位，能够使敌人眩晕."

[DroneVest_Xcom X2EquipmentTemplate]
FriendlyName="防眩晕背心"
FriendlyNamePlural="防眩晕背心"
BriefSummary="通过使用无人机材料加固纳米级背心，士兵可获得额外的生命值加成，并免疫眩晕和混乱状态."
TacticalText=" 免疫眩晕和混乱状态."

[StunDroneShield X2AbilityTemplate]
LocFriendlyName="眩晕护盾"
LocFlyOverText="眩晕护盾"
LocHelpText="免疫眩晕和混乱状态."
LocLongDescription="免疫眩晕和混乱状态."
LocPromotionPopupText=" 免疫眩晕和混乱状态."


[AutopsyDroneH X2TechTemplate]
DisplayName="无人机解剖"
CodeName="除尘器"
Summary="变种人高度依赖机械化单位进行人群控制和战争.虽然我们的专家已经掌握了入侵其编程的方法，但我们还需要做更多的工作来全面了解他们所使用的硬件.我们将从拆解我们回收的无人机残骸开始，以发展出关于变种人构造和工程过程的一般理论."
LongDescription="我们已经对变种人的机器人战斗系统有了初步的了解.它们惊人地类似于我们入侵前的设计，只是其电力系统更加高效，整体更加微型化.我们将此项目视为了解变种人更复杂设计的门户.理查德.泰根."
AlertString="无人机"